/* format for gigabytes */
"%0.1lf GB" = "%0.1lf GB";

/* format for kilobytes */
"%0.1lf KB" = "%0.1lf KB";

/* format for megabytes */
"%0.1lf MB" = "%0.1lf MB";

/* format for petabytes */
"%0.1lf PB" = "%0.1lf PB";

/* format for terabytes */
"%0.1lf TB" = "%0.1lf TB";

/* Invalid message length format string
   SysEx length format string */
"%@ bytes" = "%@ bytes";

/* format for < 1024 bytes */
"%ld bytes" = "%ld bytes";

/* string for 1 byte */
"1 byte" = "1 byte";

/* displayed type of Active Sense event */
"Active Sense" = "Active Sense";

/* displayed type of Aftertouch (poly pressure) event */
"Aftertouch" = "Aftertouch";

/* displayed type of Channel Pressure (aftertouch) event */
"Channel Pressure" = "Channel Pressure";

/* displayed type of Clock event */
"Clock" = "Clock";

/* displayed type of Continue event */
"Continue" = "Continue";

/* displayed type of Control event */
"Control" = "Control";

/* format of unknown controller */
"Controller %u" = "Controller %u";

/* Prefix for endpoint name when it's a source */
"From" = "From";

/* displayed type of Invalid event */
"Invalid" = "Invalid";

/* displayed type of MTC Quarter Frame event */
"MTC Quarter Frame" = "MTC Quarter Frame";

/* displayed type of Note Off event */
"Note Off" = "Note Off";

/* displayed type of Note On event */
"Note On" = "Note On";

/* displayed type of Pitch Wheel event */
"Pitch Wheel" = "Pitch Wheel";

/* displayed type of Program event */
"Program" = "Program";

/* displayed type of Reset event */
"Reset" = "Reset";

/* displayed type of Song Position Pointer event */
"Song Position Pointer" = "Song Position Pointer";

/* displayed type of Song Select event */
"Song Select" = "Song Select";

/* displayed type of Start event */
"Start" = "Start";

/* displayed type of Stop event */
"Stop" = "Stop";

/* displayed type of System Exclusive event */
"SysEx" = "SysEx";

/* Prefix for endpoint name when it's a destination */
"To" = "To";

/* displayed type of Tune Request event */
"Tune Request" = "Tune Request";

/* displayed type of unknown MIDI status byte
   name of missing endpoint if not specified in document */
"Unknown" = "Unknown";

/* unknown manufacturer name */
"Unknown Manufacturer" = "Unknown Manufacturer";

